api-evil-plotter-project/app/controllers/api/v1/boards_controller.rb

SELECT  "boards".* FROM "boards" WHERE (user_id = '55') ORDER BY "boards"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    # to "users/:id/boards" because of this filter by user
    @boards = Board.all # where("user_id = ?", user.id)